Public Attributes | List of all members
API_ShellBaseType Struct Reference
Element Manager API
The common parameters of roof (API_RoofType) and shell (API_ShellType) elements. More...
#include <APIdefs_Elements.h>
 Public Attributes
short  | pen
Pen attribute index of the contour.
API_AttributeIndex  | ltypeInd
Line type attribute index of the contour.
API_ModelElemStructureType  | modelElemStructureType
The structure type of the shellBase.
API_AttributeIndex  | buildingMaterial
Building Material index of shellBase's hatch. Used only, if structure type is API_BasicStrucure.
API_AttributeIndex  | composite
Composite index of shellBase. Used only, if structure type is API_CompositeStructure.
API_OverriddenPen  | cutFillPen
Cut fill pens set in the used structure (building material, composite) can be overridden on the element level.
API_OverriddenPen  | cutFillBackgroundPen
Cut fill pens set in the used structure (building material, composite) can be overridden on the element level.
API_AttributeIndex  | sectContLtype
Line type attribute index of the element's section contour.
short  | sectContPen
Contour pen attribute index of the fill in sections.
short  | floorFillPen
Pen attribute index of element's cover fill.
API_AttributeIndex  | floorFillInd
Fill attribute index of the element's cover fill.
short  | floorFillBGPen
Background pen attribute index of the element's cover fill.
short  | aboveViewLinePen
Pen used when "Overhead All" is selected from the "Floor Plan Display" popup. Corresponds to the "Overhead Line Pens" value in the element's Settings dialog.
API_AttributeIndex  | aboveViewLineType
Line type used when "Overhead All" is selected from the "Floor Plan Display" popup. Corresponds to the "Overhead Lines" value in the element's Settings dialog.
bool  | useFloorFill
Use cover fill.
bool  | use3DHatching
Use the fill attribute assigned to the surface material (vectorial 3D hatch) of the element.
bool  | useFillLocBaseLine
Align the cover fill pattern with the pivot line of the roof instead of using the fill handle.
bool  | useSlantedFill
Distort the cover fill to have the effect of a sloped roof as seen from above.
API_HatchOrientation  | hatchOrientation
Orientation and distortion parameters of the cover fill.
API_OverriddenAttribute  | topMat
Top material attribute override structure.
API_OverriddenAttribute  | sidMat
API_OverriddenAttribute  | botMat
Bottom material attribute override structure.
bool  | materialsChained
Are surface materials chained?
bool  | isAutoOnStoryVisibility
Recalculate the story visibility automatically according to the actual vertical extent of the element.
API_StoryVisibility  | visibilityCont
Visibility of the element's contour line. On the element's own story the contour should always be visible.
API_StoryVisibility  | visibilityFill
Visibility of the element's cover fill.
API_LinkToSettings  | linkToSettings
Mode of linking to home story.
double  | level
Base level of the element (reference line height in case of Roof elements) from the floor level.
double  | thickness
Thickness of the element.
API_EdgeTrim  | edgeTrim
Type of the trim of the element's edges. (In former API versions this parameter used to be called sideType.)
API_ShellBaseCutBodyTypeID  | cutBodyType
Type of the element's body extension for connections (see API_ShellBaseCutBodyTypeID).
API_ElemDisplayOptionsID  | displayOption
Display options of the element on the floor plan (see API_ElemDisplayOptionsID).
API_ElemViewDepthLimitationsID  | viewDepthLimitation
Defines the range within the element is shown on the floor plan (see API_ElemViewDepthLimitationsID).
Int32  | compositionPriority
Corresponds to the value of "Junction Order" in the settings dialogs, visible only when "Use legacy intersection and Surface methods for model elements" is set in Project Preferences / Legacy.
Detailed Description
The common parameters of roof (API_RoofType) and shell (API_ShellType) elements.
Remarks
This structure is created from API_RoofType to hold the common parameters of API_RoofType and API_ShellType. The type of the elements' structure is defined with the new modelElemStructureType member. The related attribute indices are separated into buildingMaterial and composite. The composite index is a non-negative index. The elements' cut fill foreground and background pens inherit from the element structure, and can be overridden on the element level. The elements' surface materials inherit from the element structure, and can be overridden on the element level. For shell related memo data see the ACAPI_Element_GetMemo function.
Member Data Documentation
◆ aboveViewLinePen
 API_ShellBaseType::aboveViewLinePen
Pen used when "Overhead All" is selected from the "Floor Plan Display" popup. Corresponds to the "Overhead Line Pens" value in the element's Settings dialog.
◆ aboveViewLineType
 API_ShellBaseType::aboveViewLineType
Line type used when "Overhead All" is selected from the "Floor Plan Display" popup. Corresponds to the "Overhead Lines" value in the element's Settings dialog.
◆ botMat
 API_ShellBaseType::botMat
Bottom material attribute override structure.
◆ buildingMaterial
 API_ShellBaseType::buildingMaterial
Building Material index of shellBase's hatch. Used only, if structure type is API_BasicStrucure.
◆ composite
 API_ShellBaseType::composite
Composite index of shellBase. Used only, if structure type is API_CompositeStructure.
◆ compositionPriority
 API_ShellBaseType::compositionPriority
Corresponds to the value of "Junction Order" in the settings dialogs, visible only when "Use legacy intersection and Surface methods for model elements" is set in Project Preferences / Legacy.
◆ cutBodyType
 API_ShellBaseType::cutBodyType
Type of the element's body extension for connections (see API_ShellBaseCutBodyTypeID).
◆ cutFillBackgroundPen
 API_ShellBaseType::cutFillBackgroundPen
Cut fill pens set in the used structure (building material, composite) can be overridden on the element level.
◆ cutFillPen
 API_ShellBaseType::cutFillPen
Cut fill pens set in the used structure (building material, composite) can be overridden on the element level.
◆ displayOption
 API_ShellBaseType::displayOption
Display options of the element on the floor plan (see API_ElemDisplayOptionsID).
◆ edgeTrim
 API_ShellBaseType::edgeTrim
Type of the trim of the element's edges. (In former API versions this parameter used to be called sideType.)
◆ floorFillBGPen
 API_ShellBaseType::floorFillBGPen
Background pen attribute index of the element's cover fill.
◆ floorFillInd
 API_ShellBaseType::floorFillInd
Fill attribute index of the element's cover fill.
◆ floorFillPen
 API_ShellBaseType::floorFillPen
Pen attribute index of element's cover fill.
◆ hatchOrientation
 API_ShellBaseType::hatchOrientation
Orientation and distortion parameters of the cover fill.
◆ isAutoOnStoryVisibility
 API_ShellBaseType::isAutoOnStoryVisibility
Recalculate the story visibility automatically according to the actual vertical extent of the element.
◆ level
 API_ShellBaseType::level
Base level of the element (reference line height in case of Roof elements) from the floor level.
◆ linkToSettings
 API_ShellBaseType::linkToSettings
Mode of linking to home story.
◆ ltypeInd
 API_ShellBaseType::ltypeInd
Line type attribute index of the contour.
◆ materialsChained
 API_ShellBaseType::materialsChained
Are surface materials chained?
◆ modelElemStructureType
 API_ShellBaseType::modelElemStructureType
The structure type of the shellBase.
◆ pen
 API_ShellBaseType::pen
Pen attribute index of the contour.
◆ sectContLtype
 API_ShellBaseType::sectContLtype
Line type attribute index of the element's section contour.
◆ sectContPen
 API_ShellBaseType::sectContPen
Contour pen attribute index of the fill in sections.
◆ sidMat
 API_OverriddenAttribute API_ShellBaseType::sidMat
◆ thickness
 API_ShellBaseType::thickness
Thickness of the element.
◆ topMat
 API_ShellBaseType::topMat
Top material attribute override structure.
◆ use3DHatching
 API_ShellBaseType::use3DHatching
Use the fill attribute assigned to the surface material (vectorial 3D hatch) of the element.
◆ useFillLocBaseLine
 API_ShellBaseType::useFillLocBaseLine
Align the cover fill pattern with the pivot line of the roof instead of using the fill handle.
◆ useFloorFill
 API_ShellBaseType::useFloorFill
Use cover fill.
◆ useSlantedFill
 API_ShellBaseType::useSlantedFill
Distort the cover fill to have the effect of a sloped roof as seen from above.
◆ viewDepthLimitation
 API_ShellBaseType::viewDepthLimitation
Defines the range within the element is shown on the floor plan (see API_ElemViewDepthLimitationsID).
◆ visibilityCont
 API_ShellBaseType::visibilityCont
Visibility of the element's contour line. On the element's own story the contour should always be visible.
◆ visibilityFill
 API_ShellBaseType::visibilityFill
Visibility of the element's cover fill.